[
"To escape the grip of a crocodile's jaws, push your thumbs into its eyeballs. It will let you go instantly.	",
"It took 20,000 men 22 years to build the Taj Mahal.	",
"You can tape a small mirror onto a cone speaker, play music and shine a laser on to the mirror and the reflection will look like a laser light show on your wall.	",
"Avocados have more protein than any other fruit.	",
"The can opener was invented 48 years after the can.	",
"You share your birthday with at least 9 million other people in the world.	",
"Identity crisis? About 10% of Jewish households have Christmas Trees.	",
"Pumpkin rule of thumb: the darker the shell, the longer the pumpkin lasts.	",
"First-cousin marriages are legal in Utah, so long as both parties are 65 or older!	",
" Q-Tip Cotton Swabs were originally called Baby Gays.	",
"Mark Twain didn't even make it through elementary school.	",
"Fortune cookies were actually invented in America, in 1918, by Charles Jung!	",
"The average person has over 1,460 dreams a year!	",
"Only 51% of South Carolina high school students will graduate, the lowest of any state.	",
"In the 1930's, American track star Jesse Owens used to race against horses and dogs to earn a living.	",
"A giraffe can clean its ears with its 21-inch tongue! ",
"The first Ford cars had Dodge engines.	",
"It takes twelve ears of corn to make a tablespoon of corn oil.	",
"A man named Charles Osborne had the hiccups for 69 years!	",
"Neanderthal man had a brain capcity 100cc larger than modern man's.	",
"No 2 cornflakes are identical!	",
"The first ever patent in the UK was Aaron Rathbone & Roger Burges, Map makers in 1618!	",
"A chameleon?s tongue is twice the length of its body. ",
"Technically speaking, crystal glass is actually a Liquid that flows very slowly.	",
"Austria was the first country to use postcards.	",
"One in every 4 Americans has appeared on television!	",
"To find out if a watermelon is ripe, knock it, and if it sounds hollow then it is ripe.	",
"The are six fictional characters that have stars on Hollywood's 'Walk of Fame'.	",
"Over 98 percent of Japanese people are cremated after they die.	",
"There are no clocks in Las Vegas gambling casinos. ",
"In what country will you find the most Universities? India.	",
"Americans spend more than 5.4 billion dollars on their pets each year!	",
"The tongue is the strongest muscle in the human body.	",
"The average temperature at 40,000 feet above sea level is -60 F. ",
"Actor Val Kilmer grew up on Roy Rogers' ranch.	",
"The most collect calls are made on Father's Day.	",
"The sting from a killer bee contains less venom than the sting from a regular bee!	",
"The liquid inside young coconuts can be used as a substitute for blood plasma.	",
"Cleopatras real name was Auletes! ",
"America once issued a 5-cent bill!	",
"About 400 different kinds of microbes live on and in the human body.	",
"A species of earthworm in Australia grows up to 10 feet in length.	",
"Actor John Wayne made more than 200 movies.	",
"A jellyfish is 95 percent water.	",
"Farmers in England are required by law to provide their pigs with toys!	",
"A group of frogs is called an army. ",
"On some Caribbean islands, the oysters can climb trees.	",
"Most tropical marine fish could survive in a tank filled with human blood.	",
"Males sweat 40% more than females. ",
"Only eight men were killed in the battle of lexington!	",
"The Niagara Falls moves upstream at an average rate of about 295ft a century!	",
"15 million gallons of wine were destroyed in the 1906 San Francisco earthquake.	",
"Trueman Capote the man who wrote Breakfast at Tiffany's had the middle name of Stucklefuss!	",
"The Pacific island of Nauru?s economy is almost entirely based on bird droppings.	",
"A fully loaded supertanker traveling at normal speed takes a least twenty minutes to stop.	",
"Some ribbon worms will eat themselves if they can't find any food.	",
"Many people in parts of China eat insects. Some common insects are bean worms, scoprions, and locusts.	",
"In Tibet it is considered good manners to stick out your tongue at someone.	",
"Beelzebub is Hebrew for 'Lord of the Flies'.	",
"The average human body contains enough iron to make a small nail.	",
"Michael Jordan was cut from his high school basketball team his sophomore year.	",
"If you?re typical, you can guess someone?s sex with 95% accuracy just by smelling their breath.	",
"There is no tipping at restaurants in Japan.	",
"Your skeleton keeps growing until you are about 35, then you start to shrink.	",
"Rice paper does not have any rice in it!	",
"It is illegal for tourists to enter Mexico with more than 2 CD's!	",
"Human birth control pills work on gorillas.	",
"Hyenas regularly eat the feces of other animals!	",
"It takes six months to build a Rolls Royce...and 13 hours to build a Toyota.	",
"Heineken beer is designed to 'foam' for exactly five minutes.	",
"The cruise liner, 'Queen Elizabeth 2', moves only six inches for each gallon of diesel that it burns.	",
"The lungfish can live out of water for three years in a state of suspended animation.	",
"The average American uses eight times as much fuel energy as an average person anywhere else in the world.	",
"In the great fire of London, in 1666, half of London was burnt down but only 6 people were injured.	",
"The odds of being killed by falling out of bed are one in two million.	",
"A rat can fall from a five story building without injury.	",
"Male hospital patients fall out of bed twice as often as female hospital patients. ",
"Trueman Capote the man who wrote Breakfast at Tiffany's had the middle name of Stucklefuss!	",
"Men are 6 times more likely to be struck by lightning than women.	",
"Tipping at a restaurant in Iceland is considered an insult.	",
"Drew Carey once worked at a Denny's.	",
"Goat's milk is used more widely throughout the world than cow's milk.	",
"Woodpecker scalps, porpoise teeth and giraffe tails have all been used as money.	",
"The last time American Green cards were actually green was 1964.	",
"Contrary to popular belief, dogs do not only sweat by salivating. They also sweat through the poors on their feet.	",
"Food can only be tasted if it is mixed with saliva. ",
"If your skin is laid flat it will cover an area of 18 square feet.	",
"An ounce of platinum can be stretched 10,000 feet.	",
"More than 2,500 left handed people a year are killed from using products made for right handed people.	",
"A fire in Australia has been burning for more than 5,000 years! ",
"Whispering is more wearing on your voice than a normal speaking tone.	",
"If you took a standard slinky and stretched it out it would measure 87 feet.	",
"In Florida, It is illegal to sing in a public place while attired in a swimsuit.	",
"Aluminum used to be more valuable than gold!	",
"In 21 U.S. states, WALMART is the single largest employer.	",
"Most liquid laundry detergents are alive with living organisms that help to break down stains!	",
"9 out of 10 lightning strike victims survive!	",
"Until 1796, there was a state in the United States called Franklin. Today it's known as Tennessee!	",
"A broken clock is always right twice a day.	",
"Cranberries are sorted for ripeness by bouncing them; a fully ripened cranberry can be dribbled like a basketball.	",
"During his or her lifetime, the average human will grow 590 miles of hair.	",
"In an average lifetime a person will walk the equivalent of three times around the world.	",
" An apple, potato, and onion all taste the same if you eat them with your nose plugged.	",
"The Grateful Dead were once called 'The Warlocks'.	",
"An elephant trunk has no bone but 40,000 muscles.	",
"A baby eel is called an elver, a baby oyster is called a spat.	",
"It is illegal to mispronounce 'Arkansas' while in the state of Arkansas!	",
" Astronauts get taller when they are in space.	",
"A fetus develops fingerprints at eighteen weeks!	",
"Karate actually originated in India, but was developed further in China.	",
"Nachos is the food most craved by pregnant women.	",
"Avocados have more protein than any other fruit.	",
"Of the six men who made up the Three Stooges, three of them were real brothers (Moe, Curly, and Shemp). ",
"Anteaters prefer termites to ants. ",
"The most popular first name in the world is Muhammad! ",
"A kangaroo cannot jump if its tail is off the ground.	",
"The estimated number of M&M's sold each day in the United States is 200,000,000.	",
" Nylon is made from coal and petroleum.	",
"The first person to go over Niagara falls was Annie Edson-Taylor. She made the trip in a wooden barrel and survived!	",
"Scientists are now able to grow 'beating' heart tissue in a lab!	",
"There wasn't a single pony in the Pony Express, just horses!	",
" The 'vintage date' on a bottle of wine indicates the year the grapes were picked, not the year of bottling!	",
"Even a small amount of alcohol placed on a scorpion will make it go crazy and sting itself to death.	",
"The world's smallest mammal is the bumblebee bat of Thailand, weighing less than a penny.	",
"According to legend, there?s a Superman in every episode of Seinfeld.	",
"Spinach consumption in the U.S. rose 33% after the Popeye comic strip became a hit in 1931.	",
"The giant squid has the largest eyes in the world. ",
"With two forks and a charge, a pickle will emit light.	",
"People in parts of Western China put salt in their tea instead of sugar. ",
"Linen can absorb up to 20 times its weight in moisture before it feels damp!	",
" Buttermilk does not contain any butter.	",
"Stilts were invented by French shepherds who needed a way to get around in wet marshes.	",
"90 percent of women who walk into a department store immediately turn to the right.	",
"Over 10,000 birds a year die from smashing into windows.	",
"Jacksonville, Florida, has the largest total area of any city in the United States.	",
"Deep Breathing gives you health benefits similar to aerobics.	",
"Babies that are breastfed are more likely to be slimmer as adults than those that are not breastfed.	",
"A jellyfish is 95 percent water!	",
"The male praying mantis cannot copulate while its head is attached to its body. The female initiates sex by ripping the males head off.	",
"Some breeds of chickens lay colored eggs!	",
"It would take twenty new mid-size cars to generate the same amount of pollution that a mid-size 1960's car did.	",
"Pain travels through your body at 350 ft. per second.	",
"Children are poisoned most frequently by eating harmful plants.	",
"It's illegal to own a red car in Shanghai, China.	",
"When a person dies, hearing is usually the last sense to go.	",
" Next to Warsaw, Chicago has the largest Polish population in the world.	",
"In 2003, the U.S. Government spent about $2,000,000.00 on potato research! ",
"Children are poisoned most frequently by eating harmful plants.	",
"One 75-watt bulb gives more light than three 25-watt bulbs.	",
"Baby robins eat 14 feet of earthworms every day.	",
"Girls have more tastebuds than boys.	",
"It's illegal to own a red car in Shanghai, China.	",
"Women buy four out of every 10 condoms sold.	",
"In Japan, condoms are commonly sold 'door to door'!	",
"Most dust particles in your house are made from dead skin!	",
"40% of women have hurled footwear at a man.	",
"Scientists are now able to grow 'beating' heart tissue in a lab!	",
"A baby octopus is about the size of a flea at birth.	",
"In some parts of England, rum is used to wash a baby's head for good luck.	",
"The longest word in the English language is pneumonoultramicroscopicsilicovolcanoconioses!	",
"McDonald's salads contain up to 60% more fat than their burgers!	",
"Only 1 out of 700 identity thieves gets caught!	",
"Instead of a birthday cake, many children in Russia are given a birthday pie.	",
"Ancient Egyptians slept on pillows made of stone.	",
"The oldest pig in the world lived to the age of 68.	",
"During WWII, because a lot of players were called to duty, the Pittsburgh Steelers and Philadelphia Eagles combined to become The Steagles.	",
"The estimated number of M&M's sold each day in the United States is 200,000,000.	",
"Forest fires move faster uphill than downhill.	",
"Betsy Ross was born with a fully formed set of teeth.	",
"When you correct for weight differences, men are proportionately stronger than horses.	",
"A broken clock is always right twice a day.	",
"A group of frogs is called an army. ",
"In many countries, urine was used as a detergent for washing.	",
"The penguin is the only bird that can swim, but cannot fly.	",
" Malcolm X's original name is Malcolm Little.	",
"The worlds oldest piece of chewing gum is over 9000 years old!	",
"The average 1 1/4 lb. lobster is 7 to 9 years old.	",
"68 percent of a Hostess Twinkie is air!	",
"It takes 100 pounds of rain water to produce a single pound of food from the earth.	",
"Instead of a birthday cake, many children in Russia are given a birthday pie.	",
"Nearly 22,000 checks will be deducted from the wrong account over the next hour.	",
"More than 50% of the people in the world have never made or received a telephone call.	",
"Pollen can travel up to 500 miles in a day.	",
"Stilts were invented by French shepherds who needed a way to get around in wet marshes.	",
"Chewing gum while peeling onions will keep you from crying!	",
"If you flip a coin ten times, the odds against its coming up with the same side showing each time are 1,023 to 1.	",
"The Bible is the most-shoplifted book in the world. ",
"In Bangladesh, kids as young as 15 can be jailed for cheating on their finals!	",
"There are only 14 blimps in the world.	",
"By recycling just one glass bottle, the amount of energy that is being saved is enough to light a 100 watt bulb for four hours.	",
"Switzerland has the highest per-capita consumption of soft drinks in the world.	",
"Bamboo plants can grow up to 36 inches in a day.	",
"Contrary to popular belief, hair does not grow back darker and thicker after it has been shaved.	",
"The odds of getting a hole-in-one in golf are estimated at about 18,000-to-1.	",
"More boys than girls are born during the day; more girls are born at night.	",
"More Monopoly money is printed in a year, than real money printed throughout the world!	",
"A Citreon 2CV with an oil leak once travelled 500 miles through Italy after its gearbox was filled with bananas!	",
"An elephant's tooth can weigh as much as 12 pounds. ",
" Fine-grained volcanic ash can be found as an ingredient in some toothpastes.	",
" The best time for a person to buy shoes is in the afternoon. This is because the foot tends to swell a bit around this time.	"
]